In [4]:
import numpy as np
import pandas as pd

CREATING A DATA FRAME

In [2]:
data = {
    'name': ['Alice', 'Bob', 'David', 'Diana'],
    'age': [25, 30, 35, 28],
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'salary': [70000, 80000, 75000, 72000]
}

In [3]:
pd.DataFrame(data)

    name  age         city  salary
0  Alice   25     New York   70000
1    Bob   30  Los Angeles   80000
2  David   35      Chicago   75000
3  Diana   28      Houston   72000

In [5]:
data = [
    ['Alice', 25, 'New York', 70000],
    ['Bob', 30, 'Los Angeles', 80000],
    ['David', 35, 'Chicago', 75000],
    ['Diana', 28, 'Houston', 72000]
]
columns = ['name', 'age', 'city', 'salary']

In [6]:
df2=pd.DataFrame(data,columns=columns)
df2

    name  age         city  salary
0  Alice   25     New York   70000
1    Bob   30  Los Angeles   80000
2  David   35      Chicago   75000
3  Diana   28      Houston   72000

In [17]:
df2['name']

0    Alice
1      Bob
2    David
3    Diana
Name: name, dtype: object

In [18]:
df2[['name','salary']]

    name  salary
0  Alice   70000
1    Bob   80000
2  David   75000
3  Diana   72000

adding a column

In [21]:
df2["Designation"]=['HR',"ACCOUNTANT","MANAGER","IT OFFICER"]
df2

    name  age         city  salary Designation
0  Alice   25     New York   70000          HR
1    Bob   30  Los Angeles   80000  ACCOUNTANT
2  David   35      Chicago   75000     MANAGER
3  Diana   28      Houston   72000  IT OFFICER

Dropping a column

In [25]:
df2.drop("Designation",axis=1,inplace=True)

In [26]:
df2

    name  age         city  salary
0  Alice   25     New York   70000
1    Bob   30  Los Angeles   80000
2  David   35      Chicago   75000
3  Diana   28      Houston   72000

Selecting a Rows

In [27]:
df2.loc[[0,1]]

    name  age         city  salary
0  Alice   25     New York   70000
1    Bob   30  Los Angeles   80000

In [1]:
df2.iloc[2]

NameError: name 'df2' is not defined

In [29]:
df2.loc[[0,1]][['city','salary']]

          city  salary
0     New York   70000
1  Los Angeles   80000

In [32]:
#age above 30
df2[df2["age"]>=30]

    name  age         city  salary
1    Bob   30  Los Angeles   80000
2  David   35      Chicago   75000

In [35]:
df2[(df2["age"]>=30 )& (df2["city"]=="Chicago")]

    name  age     city  salary
2  David   35  Chicago   75000